In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [7]:
df = pd.DataFrame(dict(
    age=[5, 6, np.nan],
    born=[pd.NaT, pd.Timestamp('1939-05-27'), pd.NaT],
    name=['Alfred', 'Batman', ''],
    toy=[None, 'Batmobile', 'Joker']
))

df

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN        NaT              Joker

In [6]:
print(df.isna())
#df.isnull()
df.isna().sum()

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2   True   True  False  False

age     1
born    2
name    0
toy     1
dtype: int64